#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main(){
    /* δηλώνουμε τις μεταβλητές μας*/
    double a, b, c;
    float x, x1, x2, D;

    
    printf("Δώσε τον Α όρο της εξήσωσης: ");
    scanf("%lf", &a);
    printf("Δώσε τον Β όρο της εξήσωσης: ");
    scanf("%lf", &b);
    printf("Δώσε τον Γ όρο της εξήσωσης: ");
    scanf("%lf", &c);

    /*Θα μπορούσαμε να βάλουμε ένα <<scanf("%ln %ln %ln", &a, &b, &c)>>
    αλλά θα μας ήταν δύσκολο
     να καταλάβουμε ποιος όροσ αντιστοιχεί σε ποιόν*/

     /*Έπειτα ελέγχουμε τις τιμές του χρήστη και ανάλωγα για
     τις τιμές που θα μας δώσει το πρόγραμμά μας θα κάνει τους 
     κατάληλους υπολογισμούς*/
    if(a==0&&b==0&c==0)
    printf("Η εξήσωση είναι ταυτότητα. \n");

    else if (a==0&&b==0&&c!=0)
    printf("Η εξήσωση είναι αδύνατη. \n");

    else if (a!=0&&b==0&&c==0)
    printf("Η εξήσωση είναι ταυτότητα. \n");

    else if (a==0&&b!=0&&c==0)
    printf("Η εξήσωση είναι ταυτότητα. \n");

    else if (c==0&&a!=0){
        x=-b/a;
        printf("Το Χ θα είναι 0 ή το Χ = %f\n", x);
    }

    else if (b==0&&a!=0){
        x=-c/a;
        if(x<0)
        printf("Η εξήσωση θα αδύνατη \n");
    
    else
    printf("To X = %f\n", x);
    }

    else if(a==0){
        x=-c/b;
        printf("To X = %f\n", x);
    }

    D=(b*b)-(4*a*c);

    if(a!=0&&b!=0&&c!=0&&D<0){
        printf("H e3hswsh den exei luseis");
    }

    else if(a!=0&&b!=0&&c!=0&&D==0){
        x=-b/(2*a);
        printf("Η εξήσωση έχει μία διπλή λύση X= %f", x);
    }

    else if(a!=0&&b!=0&&c!=0&&D>=0){
        x1=(-b+sqrt(D))/(2*a);
        x2=(-b-sqrt(D))/(2*a);
        printf("Η εξήσωση έχει δύο λύσεις X1=%f και X2=%f\n", x1 ,x2);
    }
    return 0;
}