# Η python μπορεί να καταλάβει από μόνη της εαν μία μεταβλιτή είναι int 
# ή float. Επομένως ητιμή my_birthday αντιστοιχή σε ακέραια τιμή 
# Η τιμή my_birthday είναι η ημέρα των γεννεθλίων μου
my_birthday = 15
# Η πιο κάτω δομή ελέγχου εξετάζει αν η τιμή της μεταβλιτής είναι αληθής για 
# την μία από τις δύο περιπτώσεις
# ΠΡΟΣΟΧΗ ΣΤΗ ΣΤΗΧΙΣΗ ΤΗΣ ΔΟΜΗΣ ΕΛΕΓΧΟΥ
if my_birthday >= 15 and my_birthday <= 30:
    #Σε περίπτωση αληθίας
    print("Αυτή είναι σωστή τιμή")
else:
    #Σεπερίπτωση ψέδους
    print("Αυτή η τιμή είναι λανθασμένη")


