max_cnt = 0
max_cnt_num = 0
# Όσο είναι αληθές τρέχει
while True:
    #Η εντολή try ελέγχει αν όντως η τιμή είναι αριθμός
    try:
        #Αρχικοποιούμε τους μετριτές μας για να μην έχουμε προβλήματα καθε φορά που τρέχει
        cnt = 0
        #Ζητάμε αριθμό από το χρήστη
        num = int(input("Δώσε αροθμό από 2-10000: "))
        #Αν ο αριθμός ικανοποιεί την συνθίκη 
        if num >= 2 and num <= 10000:
            #Κρατάμε την αρική τιμή του αριθμού
            temp = num
            #Όσο η τιμή είνα διάφορη από 1
            while num != 1:
                #Τότε χώρισε ζυγούς και μονούς
                if num % 2 == 0:

                    num = ( num // 2 )
                    
                else:

                    num = ( num * 3 ) + 1
                #Μετράμε πόσες φορές εκτελέστηκε το πρόγραμμα
                cnt = cnt + 1 
            print(f"Ο αριθμός των επαναλλήψεων είναι: {cnt}")

            if cnt > max_cnt:
                max_cnt = cnt
                #Η αποθήκευη του αριθμού με τον μεγύτερο αριθμό βημάτων
                max_cnt_num = temp
                print(f"-> Ο αριθμός {max_cnt_num} έχει το μεγαλύτερο πλήθος βημάτων.")

        else:

            # Έξοδος αν ο αριθμός είναι εκτός ορίων (π.χ., 0, 1, 10001)
            print("\nΤέλος Προγράμματος (Εκτός Ορίων)")
            break
    except ValueError:

        print("Ξαναδώσε αριθμό εντώς ορίων")



