# Όσο είναι αληθές τρέχει
while True:
    #Η εντολή try ελέγχει αν όντως η τιμή είναι αριθμός
    try:
        #Αρχικοποιούμε τους μετριτές μας για να μην έχουμε προβλήματα καθε φορά που τρέχει
        cnt = 0
        temp = []
        #Ζητάμε αριθμό από το χρήστη
        num = int(input("Δώσε αροθμό από 2-10000: "))
        #Αν ο αριθμός ικανοποιεί την συνθίκη 
        if num >= 2 and num <= 10000:
            #Τότε βάλε την πώτη τιμή του αριθμού στον πίνακα
            temp.append(str(num))
            #Όσο η τιμή είνα διάφορη από 1
            while num != 1:
                #Τότε χώρισε ζυγούς και μονούς
                if num % 2 == 0:

                    num = ( num // 2 )
                    
                else:

                    num = ( num * 3 ) + 1
                #Μετράμε πόσες φορές εκτελέστηκε το πρόγραμμα
                cnt = cnt + 1
                #Προσθέτουμε διαδοχικά σε θέσεις του πίνακα τις τιμές των πράξεων
                temp.append(str(num))

            print("->".join(temp)) 
            print(f"Ο αριθμός των επαναλλήψεων είναι: {cnt}")

        else:

            # Έξοδος αν ο αριθμός είναι εκτός ορίων (π.χ., 0, 1, 10001)
            print("\nΤέλος Προγράμματος (Εκτός Ορίων)")
            break
    except ValueError:

        print("Ξαναδώσε αριθμό εντώς ορίων")




