#Όσο η συνθίκη ισχύει επαννάλαβε.
while True:
    #Η εντολή try ελέγχει αν όντως η τιμή είναι αριθμός
    try:
        #Ζητάμε έναν ακέραιο αριθμό από το χρήστη.
        number = int(input("Δώσε αριθμό από 1 μέχρι 9:"))
        #Σε περίπτωση που είναι 0.
        if number == 0:
            print("\nΤέλος Προγράμματος")
            #Βγές από την δομή ελέγχου και τερμάτησε το πρόγραμμα.
            break
        #Σε περίπτωση που ο αριθμός είναι εντός ορίων [1,9].
        elif number >= 1 and number <= 9:
            #Δημιουργησε μου το τρίγωνο.
            for i in range(number, 0, -1):
                    print(str(i) * i)
        else:
            #Σε περίπτωση που δώση αριθμό δίαφορ από τα όρια τότε το πρόγραμμα ξαναζητάει αριθμό.
            #Η continue προσπερνά την μεταβλιτή του χρήστη και περιμένει μία νέα.
            continue
    #Αν η τιμή είναι για παράδειγμα τύπου συμβολοσειρά τότε πετάει το ValueError.    
    except ValueError:
        print("Λάθος τιμή. Ξαναδώσε νέα ")
