# Το έτος που ξεκίνησα τις σπουδές
start_study = 2025
# Ελάχιστη Διάρκεια Σπουδών σε έτη
study_duration = 4

# Η μεταβλητή που εκφράζει το έτος για την ολοκλήρωση σπουδών
study_year = 2030

# Υπολογισμός του πρώτου δυνατού έτους ολοκλήρωσης σπουδών
succes_year = start_study + study_duration

print(f"Έτος Πρώτης Εγγραφής: {start_study}")
print(f"Ελάχιστο έτος ολοκλήρωσης: {succes_year}")
print(f"Έτος Ολοκλήρωσης προς έλεγχο: {study_year}")

# Εκτέλεση ελέγχου
if study_year >= succes_year:
    print(f"Το έτος {study_year} είναι έγκυρο. Μπορείτε να ολοκληρώσετε τις σπουδές σας.")
else:
    # Υπολογισμός των ετών που απομένουν για την ελάχιστη διάρκεια
    years_needed = succes_year - study_year
    print(f"Το έτος {study_year} ΔΕΝ είναι έγκυρο. Δεν μπορείτε να ολοκληρώσετε τις σπουδές σας πριν το {succes_year} (χρειάζονται ακόμη {years_needed} έτη).")